Revit 2026 API

# ConnectionInputPoint(XYZ, Guid) Constructor

---

Construct an input point from 3d point and id.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConnectionInputPoint(
	XYZ pt,
	Guid uid
)
```
```vb
Public Sub New (
	pt As XYZ,
	uid As Guid
)
```
```cpp
public:
ConnectionInputPoint(
	XYZ^ pt,
	Guid uid
)
```
```fsharp
new :
        pt : XYZ *
        uid : Guid -> ConnectionInputPoint
```

#### Parameters

pt XYZ

uid Guid

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ConnectionInputPoint Class

ConnectionInputPoint Overload

Autodesk.Revit.DB.Structure Namespace